# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'age':[1,2,np.nan],
                  'sex':[5,np.nan,np.nan],
                  'job':[3,6,9]})

In [3]:
df

   age  sex  job
0  1.0  5.0    3
1  2.0  NaN    6
2  NaN  NaN    9

In [4]:
df.dropna()

   age  sex  job
0  1.0  5.0    3

In [5]:
df.dropna(axis=1)

   job
0    3
1    6
2    9

In [6]:
df.dropna(thresh=2)

   age  sex  job
0  1.0  5.0    3
1  2.0  NaN    6

In [7]:
df.fillna(value='FILL VALUE')

          age         sex  job
0           1           5    3
1           2  FILL VALUE    6
2  FILL VALUE  FILL VALUE    9

In [8]:
df['sex'].fillna(value=df['job'].mean())

0    5.0
1    6.0
2    6.0
Name: sex, dtype: float64

In [9]:
df['job'].mean() # tinh trung binh

6.0